In [2]:
#1. Load the patient dataset and show summary

import pandas as pd
import numpy as np

df1=pd.read_csv("Patient_Data.csv")
df2=pd.read_csv("Billing_Data.csv")

print("<=======================Patients data======================>")
print(df1.info)
print("<========================Billing data======================>")
print(df2.info)

<=======================Patients data======================>
<bound method DataFrame.info of    PatientID     Name   Department     Doctor  BillAmount  ReceptionistID  \
0        101    Alice   Cardiology  Dr. Smith      5000.0               1
1        102      Bob    Neurology   Dr. John         NaN               2
2        103  Charlie  Orthopedics    Dr. Lee      7500.0               1
3        104    David   Cardiology  Dr. Smith      6200.0               3
4        105      Eva  Dermatology   Dr. Rose         NaN               2
5        101    Alice   Cardiology  Dr. Smith      5000.0               1

        CheckInTime
0  2023-01-10 09:00
1  2023-01-11 10:30
2  2023-01-12 11:00
3  2023-01-13 12:00
4  2023-01-14 08:45
5  2023-01-10 09:00  >
<========================Billing data======================>
<bound method DataFrame.info of    PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000>

In [3]:
#2. Select only COLUMNS RELEVANT  to Billing

print("<===========================SPECIFIC COLUMNS=====================>")
df1[["PatientID","Department","Doctor","BillAmount"]]

<===========================SPECIFIC COLUMNS=====================>

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

In [4]:
#3. DROP administrative columns

#df1.drop(columns=["ReceptionistID","CheckInTime"],inplace=True)        dataframe itself gets modifies so inplace true
print("<=========================DROP COLUMNS==================================>")
updated=df1.drop(columns=["ReceptionistID","CheckInTime"])                #new variable "updated" holds modified data
updated

<=========================DROP COLUMNS==================================>

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

In [5]:
#4. Total Bill Amount per Department with GroupBy

print("<=========================TOTAL BILL AMOUNT(Dept)==================================>")
df1.groupby("Department")["BillAmount"].sum()

<=========================TOTAL BILL AMOUNT(Dept)==================================>

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

In [6]:
#5. Remove duplicate patient records on PatientID

print("<=========================DROP DUPLICATES==================================>")
updated=updated.drop_duplicates("PatientID")
updated

<=========================DROP DUPLICATES==================================>

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN

In [7]:
#6. Fill Billing Amount missing with its mean

print("<=========================FILLING MISSING VALUES(Mean)==================================>")
updated["BillAmount"]=updated["BillAmount"].fillna(np.round(updated["BillAmount"].mean(),1))
print(updated["BillAmount"])

<=========================FILLING MISSING VALUES(Mean)==================================>
0    5000.0
1    6233.3
2    7500.0
3    6200.0
4    6233.3
Name: BillAmount, dtype: float64

C:\Users\bunny\AppData\Local\Temp\ipykernel_17180\422699494.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  updated["BillAmount"]=updated["BillAmount"].fillna(np.round(updated["BillAmount"].mean(),1))

In [8]:
updated

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John      6233.3
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose      6233.3

In [9]:
#7. Merge the billing dataset with patient dataset on PatientID

print("<=========================MERGE DATASET==================================>")
merged=pd.merge(updated,df2,on="PatientID")
merged

<=========================MERGE DATASET==================================>

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,2000,3000
1,102,Bob,Neurology,Dr. John,6233.3,1500,3500
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,2500,5000
3,104,David,Cardiology,Dr. Smith,6200.0,3000,3200
4,105,Eva,Dermatology,Dr. Rose,6233.3,1000,4000

In [10]:
#8. Concatinate new patients for the current week(row-wise)

df_new=pd.DataFrame({
    'PatientID':[106,107],
    'Name':['Bunny','Aloo'],
    'Department':['Archeology','History'],
    'Doctor':['Dr. Praneetha','Dr. Pranav'],
    'BillAmount':[4000.0,7500.0],
})
updated_df=pd.concat([merged,df_new],ignore_index=True)
updated_df

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,2000.0,3000.0
1,102,Bob,Neurology,Dr. John,6233.3,1500.0,3500.0
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,2500.0,5000.0
3,104,David,Cardiology,Dr. Smith,6200.0,3000.0,3200.0
4,105,Eva,Dermatology,Dr. Rose,6233.3,1000.0,4000.0
5,106,Bunny,Archeology,Dr. Praneetha,4000.0,NaN,NaN
6,107,Aloo,History,Dr. Pranav,7500.0,NaN,NaN

In [11]:
#9.	Concatenate new category columns like ['InsuranceCovered', 'FinalAmount'] (column-wise).

updated_df.loc[updated_df['PatientID']==106,["InsuranceCovered","FinalAmount"]]=[1000,5000]
updated_df.loc[updated_df['PatientID']==107,["InsuranceCovered","FinalAmount"]]=[1500,4000]
updated_df

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,2000.0,3000.0
1,102,Bob,Neurology,Dr. John,6233.3,1500.0,3500.0
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,2500.0,5000.0
3,104,David,Cardiology,Dr. Smith,6200.0,3000.0,3200.0
4,105,Eva,Dermatology,Dr. Rose,6233.3,1000.0,4000.0
5,106,Bunny,Archeology,Dr. Praneetha,4000.0,1000.0,5000.0
6,107,Aloo,History,Dr. Pranav,7500.0,1500.0,4000.0